Tekla Open API Reference for Tekla Structures 2025
FormingStates.Folding Property
 Gets or sets the folding type.
 Namespace: Tekla.Structures.Forming
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public FoldingType Folding { get; set; }
Public Property Folding As FoldingType
	Get
	Set
Property Value
Type: FoldingType
See Also
Reference
FormingStates Class
Tekla.Structures.Forming Namespace